Backend/loadtest/artillery-smoke.yml
config:
  target: "http://localhost:4000"
  phases:
    # Quick smoke test: 10 users for 30 seconds
    - duration: 30
      arrivalRate: 10
      name: "Smoke test"

  defaults:
    headers:
      Content-Type: "application/json"

  ensure:
    thresholds:
      - http.response_time.p95: 2000
      - http.codes.2xx: 98

scenarios:
  - name: "Quick Health + Auth Check"
    flow:
      - get:
          url: "/health"
          expect:
            - statusCode: 200
      - post:
          url: "/api/auth/send-otp"
          json:
            phone: "+919876543210"
          capture:
            - json: "$.otp"
              as: "otp"
          expect:
            - statusCode: 200
      - post:
          url: "/api/auth/verify-otp"
          json:
            phone: "+919876543210"
            otp: "{{ otp }}"
          capture:
            - json: "$.token"
              as: "token"
          expect:
            - statusCode: 200
      - get:
          url: "/api/user/profile"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200
      - get:
          url: "/api/products?page=1&limit=5"
          expect:
            - statusCode: 200